In [52]:
import pandas as pd

In [53]:
df = pd.read_csv('C:\\Users\\power\\Downloads\\titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [54]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [55]:
target = df.Survived
input = df.drop('Survived', axis='columns')
input.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

#### Above table Sex contains string, we need to get it's numerical by using dummies

In [56]:
dummies = pd.get_dummies(input.Sex)
dummies.head()

   female   male
0   False   True
1    True  False
2    True  False
3    True  False
4   False   True

In [57]:
input = pd.concat([input, dummies], axis='columns')
input.head()

   Pclass     Sex   Age     Fare  female   male
0       3    male  22.0   7.2500   False   True
1       1  female  38.0  71.2833    True  False
2       3  female  26.0   7.9250    True  False
3       1  female  35.0  53.1000    True  False
4       3    male  35.0   8.0500   False   True

In [61]:
input.drop(['Sex', 'male'], axis='columns', inplace=True)
input.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500   False
1       1  38.0  71.2833    True
2       3  26.0   7.9250    True
3       1  35.0  53.1000    True
4       3  35.0   8.0500   False

#### Ensure data are clear, not contains NaN value

There says Age contains NaN value

In [66]:
input.columns[input.isna().any()]

Index(['Age'], dtype='object')

In [69]:
input.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

Remove NaN value use fillna() and then insert mean value

In [70]:
input.Age = input.Age.fillna(input.Age.mean())
input.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500   False
1       1  38.0  71.2833    True
2       3  26.0   7.9250    True
3       1  35.0  53.1000    True
4       3  35.0   8.0500   False

In [72]:
input.columns[input.isna().any()]

Index([], dtype='object')

In [81]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(input, target, test_size=0.2)

In [82]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [83]:
model.fit(x_train, y_train)

GaussianNB()

In [84]:
model.score(x_test, y_test)

0.7541899441340782

In [89]:
model.predict(x_test[:10])

array([0, 1, 0, 1, 1, 1, 1, 0, 1, 1], dtype=int64)

In [91]:
model.predict_proba(x_test[:10])

array([[9.61488419e-01, 3.85115807e-02],
       [2.02534052e-01, 7.97465948e-01],
       [9.63240397e-01, 3.67596030e-02],
       [1.98916145e-01, 8.01083855e-01],
       [2.06720062e-01, 7.93279938e-01],
       [1.36326322e-04, 9.99863674e-01],
       [2.33765357e-07, 9.99999766e-01],
       [7.84387195e-01, 2.15612805e-01],
       [3.21098570e-01, 6.78901430e-01],
       [3.08876953e-01, 6.91123047e-01]])

## Calculate score by using cross validation

In [102]:
from sklearn.model_selection import cross_val_score
cross_val_score(GaussianNB(), x_train, y_train, cv=5)

array([0.78321678, 0.82517483, 0.78169014, 0.77464789, 0.76056338])